update docs for loki/alloy and update README.md
